



var arrLang = {
    'ua': {
        'advantage': 'Переваги',
        'home': 'Головна',
        'services': 'Послуги',
        'portfolio': 'Портфоліо',
        'contacts': 'Контакти',
        'anAppointment': 'ЗАПИСАТИСЬ',
        'title-1': 'ДЕТЕЙЛІНГ МЕНЮ',
        'title-2': 'ГОРТАЙ ДАЛІ',
        'title-3': 'ОСНОВНІ ПОСЛУГИ',
        'title-4': 'НАШІ ПЕРЕВАГИ',
        'title-5': 'ЧОМУ ОБИРАЮТЬ НАС',
        'title-6': 'ПОРТФОЛІО',
        'title-7': 'ВІДГУКИ',
        'title-8': 'ЛЮДИ НАМ ДОВІРЯЮТЬ',

        'feedback_before': 'ДО',
        'feedback_after': 'ПІСЛЯ',

        //FEEDBACKS-CAN-BE-CHANGED-START
        'feedback_text-1': 'Хочу окремо відмітити клієнто орієнтованість майстрів. Коли забирав машину, у мене з`явилося декілька зауважень.Всі мої "примхи" були реалізовані прямо у мене на очах.При чому доволі якісно.Наприклад про зону завантаження.Зазвичай оклейка йде звичайна, без аплікацій.Таку можна побачити на хюндаях та різних таксі, щоб пасажири не обідрали валізами бампер, коли запихатимуть їх у багажника.Мені спочатку так само зробили.Але після уточнення моїх вимог переробили так, як я хочу - щоб плівку не було помітно.',
        'feedback_name-1': 'Водій Alfa Romeo Giulia(952)',
        //FEEDBACKS-CAN-BE-CHANGED-END

        'package-from': 'від',



        'filter-btn-1': 'ВСІ',
        'filter-btn-2': 'ХІМЧИСТКА',
        'filter-btn-3': 'ПОЛІРУВАННЯ',
        'filter-btn-4': 'ТОНУВАННЯ',
        'filter-btn-5': 'ПЛІВКА',

        'form_info_address': 'м.Київ, вул. Бакинська, 35А',
        'form_info_socialmedia': 'Ми у соц мережах:',
        'form_info_schedule_text': 'Час роботи',

        'form_info_name': "Ім'я*",
        'form_info_phone': "Телефон*",
        'leadform_send': 'Надіслати',
        'schedule_dayout': 'Неділя: вихідний',
        'footer_info_descr': '"Ваш експерт у детейлінгу авто, де якість і стиль поєднуються."',
        'footer_address_text': 'Адреса',
        'footer_address': 'м.Київ, вул. Бакинська 35А',
        'footer_phone_text': 'Телефони',
        'footer_address_way': 'Отримати маршрут',
        'footer_email_text': 'Пошта',

        //services
        'service_name-0': 'Консультація',

        'service_name-1': 'Полірування кузова',
        'service_descr-1': 'відновлює блиск і глибину кольору автомобіля, видаляючи подряпини та забруднення.',

        'service_name-2': 'Нанесення захисних покриттів',
        'service_descr-2': 'Нанесення захисних покриттів гарантує захист від подряпин, корозії, атмосферних впливів, сонячного випромінювання, запобігає контакту лакофарбового шару з вологою.',

        'service_name-3': 'Антихром',
        'service_descr-3': 'це відмінний спосіб коригування стилю вашого авто і збереження хрому у первозданному стані.',

        'service_name-4': 'Тонування',
        'service_descr-4': 'захищає салон і приладову дошку від вигорання, зменшує яскравість сонячного світла та сліпучі фари, надає приватність, зменшуючи надокучливі погляди.',

        'service_name-5': 'Обклеювання кузова захисною плівкою',
        'service_descr-5': 'захищає від подряпин, потертостей, дорожніх реагентів, ультрафіолету, запобігає розшаруванню, розтріскуванню лакофарбового покриття, знижує ризик корозії.',

        'service_name-6': 'Полірування оптики',
        'service_descr-6': 'виправляє помутніння, пожовтіння та усуває дрібні дефекти і подряпини.',

        'service_name-7': 'Очищення та полірування колісних дисків',
        'service_descr-7': 'збереження вихідного блиску алюмінієвих дисків і запобігання утворенню іржі на сталевих.',

        'service_name-8': 'Глибоке очищення скла',
        'service_descr-8': 'Видаляє бруд, залишки поліролей, атмосферних опадів, гудрону, комах, силікону від щіток-очисників, соку дерев.',

        'service_name-9': 'Антидощ',
        'service_descr-9': 'забезпечує захист від води, бруду: будь-який пил починає зісковзувати з поверхні.',

        'service_name-10': 'Ремонт скла',
        'service_descr-10': 'Усунення тріщин та сколів на склі.',

        'service_name-11': 'Полірування лобового скла',
        'service_descr-11': 'Процедура видаляє верхній пошкоджений шар скла, зберігаючи його цілісність, використовуючи якісні абразивні матеріали для усунення дрібних дефектів.',

        'service_name-12': 'Детейлінг хімчистка салону',
        'service_descr-12': 'ретельне очищення всіх елементів салону з видаленням неприємних запахів. Це найкращий спосіб підтримувати автомобіль у доглянутому стані.',

        'service_name-13': 'Шумоізоляція',
        'service_descr-13': 'Зменшення рівня шуму в салоні.',

        'service_name-14': 'Детейлінг підкапотного простору',
        'service_descr-14': 'професійне очищення та догляд, що забезпечують повну безпеку всіх агрегатів підкапотного простору. Брудний підкапотний простір негативно впливає на теплообмін двигуна.',

        'service_name-15': 'Озонування',
        'service_descr-15': 'Видалення неприємних запахів з салону.',

        'service_name-16': 'Реставрація салону',
        'service_descr-16': 'відновлення пошкоджених або зношених елементів салону автомобіля. Реставрація та фарбування шкіри та пластику в салоні автомобіля.',



        'service-title-1': 'Полірування',
        'service_descrr-1': 'Відновлює блиск і захищає кузов від пошкоджень.',

        'service-title-2': 'Захисне керамічне покриття',
        'service_descrr-2': 'Рішення для збереження та захисту поверхонь від впливу навколишнього середовища.',

        'service-title-3': 'Обклеювання антигравійною плівкою',
        'service_descrr-3': 'Ефективний спосіб захисту та оновлення зовнішнього вигляду вашого автомобіля або будь-якої іншої поверхні.',

        'service-title-4': 'Полірування лобового скла',
        'service_descrr-4': 'Ця процедура видаляє дрібні подряпини, потертості та відкладення, відновлюючи прозорість скла та забезпечуючи кращу видимість в умовах недостатнього освітлення або поганих погодних умов.',

        'service-title-5': 'Тонування',
        'service_descrr-5': 'Тонування захищає від ультрафіолетових променів, зменшує відблиски, забезпечує комфортну температуру всередині та допомагає запобігти вигоранню оббивки.',

        'service-title-6': 'Детейлінг хімчистка',
        'service_descrr-6': 'Процедура включає видалення бруду, пилу, плям та неприємних запахів з усіх поверхонь, таких як сидіння, килимки, панелі, та інші елементи салону.',

        'why_text-1': '3 роки на ринку',
        'why_text-2': '5 досвідчених майстрів',
        'why_text-3': '500+ постійних клієнтів',
        'why_text-4': '3000+ клієнтів в рік',

        'h3-adv-1': 'Широкий спектр послуг',
        'p-adv-1': 'Від хімчистки до поліровки',

        'h3-adv-2': 'Комплексний підхід',
        'p-adv-2': 'всі роботи виконують одні й ті ж фахівці, що підвищує якість.',

        'h3-adv-3': 'Гнучкість',
        'p-adv-3': 'господар може вибирати етапи роботи.',

        'h3-adv-4': 'Деталізація',
        'p-adv-4': 'обробляється кожен куточок кузова та салону, включаючи піддон під запасне колесо.',

        'h3-adv-5': 'Висока якість',
        'p-adv-5': 'використовуються найкращі матеріали та засоби.',


    },

    'ru': {
        'advantage': 'Преимущества',
        'home': 'Главная',
        'services': 'Услуги',
        'portfolio': 'Портфолио',
        'contacts': 'Контакты',
        'anAppointment': 'ЗАПИСАТЬСЯ',
        'title-1': 'ДЕТЕЙЛИНГ МЕНЮ',
        'title-2': 'ЛИСТАЙ ДАЛЬШЕ',
        'title-3': 'ОСНОВНЫЕ УСЛУГИ',
        'title-4': 'НАШИ ПРЕИМУЩЕСТВА',
        'title-5': 'ПОЧЕМУ ВЫБИРАЮТ НАС',
        'title-6': 'ПОРТФОЛИО',
        'title-7': 'ОТЗЫВЫ',
        'title-8': 'ЛЮДИ НАМ ДОВЕРЯЮТ',

        'feedback_before': 'ДО',
        'feedback_after': 'ПОСЛЕ',

        'feedback_text-1': 'Хочу отдельно отметить клиенто ориентированность мастеров. Когда забирал машину, у меня появилось несколько замечаний. Все мои "капризы" были реализованы прямо у меня на глазах. Причем достаточно качественно. К примеру о зоне загрузки. Обычно оклейка идет обычная, без аппликаций. Такую можно увидеть на хюндаях и разных такси, чтобы пассажиры не ободрали чемоданы бампер, когда будут запихивать их в багажник. Мне поначалу так же поступили. Но после уточнения моих требований переделали так, как я хочу – чтобы пленку не было заметно.',
        'feedback_name-1': 'Водитель Alfa Romeo Giulia(952)',
        'package-from': 'от',


        'filter-btn-1': 'ВСЕ',
        'filter-btn-2': 'ХИМЧИСТКА',
        'filter-btn-3': 'ПОЛИРОВКА',
        'filter-btn-4': 'ТОНИРОВКА',
        'filter-btn-5': 'ПЛЁНКА',

        'form_info_address': 'г. Киев, ул. Бакинская, 35А',
        'form_info_socialmedia': 'Мы в соцсетях:',
        'form_info_schedule_text': 'Время работы',
        'schedule_dayout': 'Воскресенье: выходной',
        'form_info_name': `Имя*`,
        'form_info_phone': `Телефон*`,
        'leadform_send': 'Отправить',

        'footer_info_descr': '"Ваш эксперт в детейлинге авто, где качество и стиль сочетаются."',
        'footer_address_text': 'Адрес',
        'footer_address': 'г. Киев, ул. Бакинская 35А',
        'footer_phone_text': 'Телефоны',
        'footer_address_way': 'Проложить маршрут',
        'footer_email_text': 'Почта',

        'service_name-0': 'Консультация',

        'service_name-1': 'Полировка кузова',
        'service_descr-1': 'восстанавливает блеск и глубину цвета автомобиля, удаляя царапины и загрязнения.',

        'service_name-2': 'Нанесение защитных покрытий',
        'service_descr-2': 'Нанесение защитных покрытий обеспечивает защиту от царапин, коррозии, атмосферных воздействий, солнечного излучения, предотвращает контакт лакокрасочного слоя с влагой.',

        'service_name-3': 'Антихром',
        'service_descr-3': 'это отличный способ корректировки стиля вашего авто и сохранения хрома в первозданном состоянии.',

        'service_name-4': 'Тонировка',
        'service_descr-4': 'защищает салон и приборную панель от выгорания, уменьшает яркость солнечного света и ослепляющие фары, обеспечивает приватность, уменьшая надоедливые взгляды.',

        'service_name-5': 'Обклеивание кузова защитной пленкой',
        'service_descr-5': 'защищает от царапин, потертостей, дорожных реагентов, ультрафиолетового излучения, предотвращает расслоение, растрескивание лакокрасочного покрытия, снижает риск коррозии.',

        'service_name-6': 'Полировка оптики',
        'service_descr-6': 'исправляет помутнение, пожелтение и устраняет мелкие дефекты и царапины.',

        'service_name-7': 'Очистка и полировка колесных дисков',
        'service_descr-7': 'сохранение исходного блеска алюминиевых дисков и предотвращение образования ржавчины на стальных.',

        'service_name-8': 'Глубокая очистка стекол',
        'service_descr-8': 'Удаляет грязь, остатки полиролей, атмосферные осадки, дорожные смолы, насекомых, силикон от щеток-очистителей, сок деревьев.',

        'service_name-9': 'Антидождь',
        'service_descr-9': 'обеспечивает защиту от воды и грязи: любой пыль начинает скользить с поверхности.',

        'service_name-10': 'Ремонт стекол',
        'service_descr-10': 'Удаление трещин и сколов на стекле.',

        'service_name-11': 'Полировка лобового стекла',
        'service_descr-11': 'Процедура удаляет верхний поврежденный слой стекла, сохраняя его целостность, используя качественные абразивные материалы для устранения мелких дефектов.',

        'service_name-12': 'Детейлинг химчистка салона',
        'service_descr-12': 'тщательная очистка всех элементов салона с удалением неприятных запахов. Это лучший способ поддерживать автомобиль в ухоженном состоянии.',

        'service_name-13': 'Шумоизоляция',
        'service_descr-13': 'Снижение уровня шума в салоне.',

        'service_name-14': 'Детейлинг подкапотного пространства',
        'service_descr-14': 'профессиональная очистка и уход, обеспечивающие полную безопасность всех агрегатов подкапотного пространства. Грязное подкапотное пространство негативно влияет на теплообмен двигателя.',

        'service_name-15': 'Озонирование',
        'service_descr-15': 'Удаление неприятных запахов из салона.',

        'service_name-16': 'Реставрация салона',
        'service_descr-16': 'восстановление поврежденных или изношенных элементов салона автомобиля. Реставрация и покраска кожи и пластика в салоне автомобиля.',

        'service-title-1': 'Полировка',
        'service_descrr-1': 'Восстанавливает блеск и защищает кузов от повреждений.',

        'service-title-2': 'Защитное керамическое покрытие',
        'service_descrr-2': 'Решение для сохранения и защиты поверхностей от воздействия окружающей среды.',

        'service-title-3': 'Оклейка антигравийной пленкой',
        'service_descrr-3': 'Эффективный способ защиты и обновления внешнего вида вашего автомобиля или любой другой поверхности.',

        'service-title-4': 'Полировка лобового стекла',
        'service_descrr-4': 'Эта процедура удаляет мелкие царапины, потертости и отложения, восстанавливая прозрачность стекла и обеспечивая лучшую видимость в условиях недостаточного освещения или плохих погодных условий.',

        'service-title-5': 'Тонирование',
        'service_descrr-5': 'Тонирование защищает от ультрафиолетовых лучей, уменьшает блики, обеспечивает комфортную температуру внутри и помогает предотвратить выгорание обивки.',

        'service-title-6': 'Детейлинг химчистка',
        'service_descrr-6': 'Процедура включает удаление грязи, пыли, пятен и неприятных запахов со всех поверхностей, таких как сиденья, коврики, панели и другие элементы салона.',

        "why_text-1": "3 года на рынке",
        "why_text-2": "5 опытных мастеров",
        "why_text-3": "500+ постоянных клиентов",
        "why_text-4": "3000+ клиентов в год",

        "h3-adv-1": "Широкий спектр услуг",
        "p-adv-1": "От химчистки до полировки",

        "h3-adv-2": "Комплексный подход",
        "p-adv-2": "Все работы выполняются одними и теми же специалистами, что повышает качество.",

        "h3-adv-3": "Гибкость",
        "p-adv-3": "Владелец может выбирать этапы работы.",

        "h3-adv-4": "Детализация",
        "p-adv-4": "Обрабатывается каждый уголок кузова и салона, включая поддон под запасное колесо.",

        "h3-adv-5": "Высокое качество",
        "p-adv-5": "Используются лучшие материалы и средства."
    }
}

$(function () {
    $('.translate').click(function () {
        var lang = $(this).attr('id');

        $('.lang').each(function (index, item) {
            $(this).text(arrLang[lang][$(this).attr('key')]);
        });
    });
});